{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-PER",
    "2": "I-PER",
    "3": "B-LOC",
    "4": "I-LOC",
    "5": "B-ORG",
    "6": "I-ORG",
    "7": "B-HEALTH",
    "8": "I-HEALTH",
    "9": "B-CHILD",
    "10": "I-CHILD"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-CHILD": 9,
    "B-HEALTH": 7,
    "B-LOC": 3,
    "B-ORG": 5,
    "B-PER": 1,
    "I-CHILD": 10,
    "I-HEALTH": 8,
    "I-LOC": 4,
    "I-ORG": 6,
    "I-PER": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "vocab_size": 30522
}
