{
  "_name_or_path": "models/tinybert4l-ner-v2/",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "cell": {},
  "classifier_dropout": null,
  "emb_size": 312,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "O",
    "1": "B-PER",
    "2": "I-PER",
    "3": "B-LOC",
    "4": "I-LOC",
    "5": "B-ORG",
    "6": "I-ORG",
    "7": "B-HEALTH",
    "8": "I-HEALTH",
    "9": "B-CHILD",
    "10": "I-CHILD"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1200,
  "label2id": {
    "B-CHILD": 9,
    "B-HEALTH": 7,
    "B-LOC": 3,
    "B-ORG": 5,
    "B-PER": 1,
    "I-CHILD": 10,
    "I-HEALTH": 8,
    "I-LOC": 4,
    "I-ORG": 6,
    "I-PER": 2,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "pre_trained": "",
  "structure": [],
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
